---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoomPerimeter
source: html/a44e4571-3b87-8288-a70f-831b3fc7ea30.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoomPerimeter Property

"Perimeter"

## Syntax (C#)
```csharp
public static ForgeTypeId RoomPerimeter { get; }
```